{
  "backend/main.mo": "Main Motoko actor defining lesson, practice problem, and progress types with initialization functions for fractions and decimals lessons, plus data storage maps for lessons, problems, and user progress.",
  "backend/migration.mo": "Migration module that transforms old lesson records (without topic field) to new lesson records (with topic field) by mapping lesson IDs to default topics.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features for lesson browser and lesson detail page verification with associated test IDs and component dependencies.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components including pages, hooks, and UI components with descriptions of their functionality and mainnet deployment considerations.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes including primary, secondary, accent, and sidebar color tokens.",
  "frontend/index.html": "HTML entry point with production-ready meta tags, theme color, Inter font preloading, and root div for React mounting.",
  "frontend/src/App.tsx": "TanStack Router configuration defining all application routes including home, lessons, practice area, progress tracking, and practice mode session routes with Layout wrapper.",
  "frontend/src/components/AchievementBadge.tsx": "Achievement badge component displaying achievement text with dynamically selected badge images based on achievement type, including error handling for missing images.",
  "frontend/src/components/Layout.tsx": "Root layout component wrapping all pages with Navigation header and footer containing copyright and Caffeine.ai attribution link.",
  "frontend/src/components/LessonCard.tsx": "Reusable lesson card component displaying lesson title, difficulty stars, topic badge with emoji, content preview, and hover effects for navigation to lesson details.",
  "frontend/src/components/Navigation.tsx": "Main navigation component with sticky header, logo, nav links (Home, Lessons, Practice, Practice Mode, Progress), and Internet Identity authentication dropdown menu.",
  "frontend/src/components/PracticeProblem.tsx": "Displays a single practice problem with input field, submit/reset buttons, and feedback UI showing correct/incorrect results with themed messages.",
  "frontend/src/components/PracticeSessionHeader.tsx": "Sticky header for practice sessions displaying topic name, progress counter (problems completed/total), and elapsed time with timer hook.",
  "frontend/src/components/ProgressDashboard.tsx": "Dashboard displaying user progress stats (lessons completed, streak, average score), motivational messages, achievements grid, and practice history list.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling authentication state changes and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useCompleteLesson.ts": "Mutation hook to mark a lesson as completed via the backend actor and invalidate progress queries on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing AuthClient lifecycle, login/logout flows, and identity state with delegation validation.",
  "frontend/src/hooks/useLessons.ts": "Query hook to fetch all lessons from the backend actor, enabled only when actor is ready.",
  "frontend/src/hooks/usePracticeProblems.ts": "Query hook to fetch all practice problems from the backend actor, enabled only when actor is ready.",
  "frontend/src/hooks/usePracticeProblemsByTopic.ts": "Query hook to fetch practice problems filtered by topic from the backend actor, enabled when actor and topic are available.",
  "frontend/src/hooks/usePracticeSessionTimer.ts": "Timer hook that tracks elapsed seconds in a practice session and formats time as MM:SS string.",
  "frontend/src/hooks/useProgress.ts": "Query hook to fetch user progress data from the backend actor, enabled only when actor is ready.",
  "frontend/src/hooks/useSubmitPracticeScore.ts": "Mutation hook to submit a practice problem score to the backend and invalidate progress queries on success.",
  "frontend/src/hooks/useSubmitPracticeSession.ts": "Mutation hook to record a complete practice session to the backend and invalidate progress queries on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a neon green color scheme for light and dark modes, plus base styles for typography using Inter font.",
  "frontend/src/main.tsx": "Application entry point that sets up React with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, feature cards, and CTAs using Gen-Z slang; displays login/start learning buttons based on authentication state and showcases app benefits.",
  "frontend/src/pages/LessonBrowser.tsx": "Displays filterable list of math lessons organized by topics (fractions, algebra, geometry, etc.) with loading states, error handling, and retry functionality for backend canister connection.",
  "frontend/src/pages/LessonDetail.tsx": "Shows individual lesson content with formatted markdown rendering, topic badges, difficulty stars, and a completion button that marks lessons as complete via backend mutation.",
  "frontend/src/pages/PracticeArea.tsx": "Practice problem interface with navigation between problems, progress tracking, loading/error states, and displays individual practice problems using the PracticeProblem component.",
  "frontend/src/pages/PracticeModePage.tsx": "Topic selection page displaying eight math topics (fractions, decimals, percentages, etc.) as clickable cards with icons and Gen-Z descriptions, routing to topic-specific practice sessions.",
  "frontend/src/pages/PracticeSessionPage.tsx": "Main practice session page that displays problems for a given topic, tracks user answers, manages navigation between problems, and handles session completion with timer tracking and submission to backend.",
  "frontend/src/pages/PracticeSessionSummary.tsx": "Displays practice session results including accuracy, problems attempted, duration, and motivational messages; submits session data to backend and provides options to retry or return to topic selection.",
  "frontend/src/pages/ProgressTracking.tsx": "Progress tracking page that requires Internet Identity authentication to display user's learning progress dashboard, with loading states and error handling for backend connectivity.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, extended border radius values, custom animations, and typography/container query plugins.",
  "project_state.json": "Project metadata file tracking features, requirements, and architectural state for a math learning app with brainrot themes for middle schoolers (appears to contain legacy alto-singing tutor feature descriptions)."
}