{
  "backend/main.mo": "Main Motoko actor defining types (Lesson, PracticeProblem, Progress, PracticeSession) and storage maps for lessons, problems, and user progress with initialization and query functions.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Text file containing JSON summaries of all frontend source files including components, pages, hooks, and configuration files.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining design tokens for colors, borders, and UI elements.",
  "frontend/index.html": "HTML entry point with meta tags, Inter font preloading, and root div for React application mounting.",
  "frontend/src/App.tsx": "TanStack Router setup defining all application routes including home, lessons, practice areas, practice mode with topic selection, sessions, and summaries.",
  "frontend/src/components/AchievementBadge.tsx": "Component displaying achievement badges with dynamic image selection based on achievement text and fallback error handling.",
  "frontend/src/components/Layout.tsx": "Root layout component wrapping all pages with Navigation header, gradient background, and footer with Caffeine.ai attribution.",
  "frontend/src/components/LessonCard.tsx": "Clickable lesson card component displaying lesson title, difficulty stars, preview text extracted from content, and hover effects.",
  "frontend/src/components/Navigation.tsx": "Sticky header navigation with logo, route links with active states, and authentication UI including Internet Identity login/logout with dropdown menu.",
  "frontend/src/components/PracticeProblem.tsx": "Displays a practice problem with an input field for answers, validates submissions against the correct answer, submits scores via mutation hook, and shows feedback with icons and reset functionality.",
  "frontend/src/components/PracticeSessionHeader.tsx": "Renders a sticky header for practice sessions showing the topic name, progress counter (problems completed/total), and elapsed time using a custom timer hook.",
  "frontend/src/components/ProgressDashboard.tsx": "Displays user progress statistics including completed lessons, current streak, average score, achievements with badges, and practice score history in a grid layout.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity authentication state, automatically invalidating and refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useCompleteLesson.ts": "Provides a mutation hook to mark a lesson as complete via the actor and invalidates the progress query on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider with login/logout functionality, identity management, and status tracking using AuthClient from @dfinity/auth-client.",
  "frontend/src/hooks/useLessons.ts": "Query hook that fetches all lessons from the backend actor when authenticated.",
  "frontend/src/hooks/usePracticeProblems.ts": "Query hook that fetches all practice problems from the backend actor when authenticated.",
  "frontend/src/hooks/usePracticeProblemsByTopic.ts": "Query hook that fetches practice problems filtered by a specific topic from the backend actor.",
  "frontend/src/hooks/usePracticeSessionTimer.ts": "Custom hook that tracks elapsed time in seconds using an interval and formats it as MM:SS for display.",
  "frontend/src/hooks/useProgress.ts": "Query hook that fetches the user's progress data (completed lessons, streak, scores) from the backend actor.",
  "frontend/src/hooks/useSubmitPracticeScore.ts": "Mutation hook that submits a practice problem score to the backend and invalidates the progress query on success.",
  "frontend/src/hooks/useSubmitPracticeSession.ts": "Mutation hook that records a complete practice session to the backend and invalidates the progress query on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors using a neon green primary palette and Inter font family.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, feature highlights, and CTA buttons that adapt based on Internet Identity authentication status. Displays mascot image and promotes math learning with 'brainrot' themed messaging.",
  "frontend/src/pages/LessonBrowser.tsx": "Displays a grid of available lessons fetched from the backend canister, with loading states, error handling with retry functionality, and navigation to individual lesson details.",
  "frontend/src/pages/LessonDetail.tsx": "Shows detailed lesson content with markdown-style formatting (headings, bold text, lists), extracts and displays pro tips separately, and provides a completion button that marks the lesson as complete.",
  "frontend/src/pages/PracticeArea.tsx": "Displays practice problems one at a time with navigation controls (previous/next), progress indicator, and comprehensive error handling with retry functionality for backend connection issues.",
  "frontend/src/pages/PracticeModePage.tsx": "Topic selection page showing eight math topics (fractions, decimals, percentages, algebra, geometry, ratios, multiplication, division) as clickable cards with icons and themed colors, each navigating to topic-specific practice sessions.",
  "frontend/src/pages/PracticeSessionPage.tsx": "Manages a timed practice session for a specific topic, tracking answers across multiple problems with navigation controls, and provides finish/exit dialogs that submit session results to the backend before navigating to a summary page.",
  "frontend/src/pages/PracticeSessionSummary.tsx": "Displays practice session results (problems attempted, correct count, accuracy, duration) with motivational messages and navigation options to retry or return to topics. Submits session data to backend via useSubmitPracticeSession hook on mount.",
  "frontend/src/pages/ProgressTracking.tsx": "Shows user progress dashboard with authentication gate requiring Internet Identity login. Displays loading states, error handling with retry, and renders ProgressDashboard component when authenticated and data is loaded.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration using OKLCH color space for theming, custom border radius variables, Inter font family, and plugins for typography, container queries, and animations. Includes custom accordion keyframe animations.",
  "project_state.json": "Project metadata file tracking features, requirements, and architectural state for a math learning app targeting middle schoolers with brainrot themes. Contains schema version, feature list with IDs and requirement mappings."
}