{
  "kind": "build_request",
  "title": "Add comprehensive lessons for all practice mode topics",
  "projectName": "Brainrot Math",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-63",
      "text": "Expand the backend lesson initialization to include at least 3 comprehensive lessons for the 'Fractions' topic, covering foundational concepts like equivalent fractions, adding/subtracting fractions with like and unlike denominators, and multiplying/dividing fractions. Each lesson must include brainrot-themed explanations, examples, and pro tips suitable for middle school (grades 6-8).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-final"
        ],
        "quotes": [
          "Add lessons to all topics"
        ]
      },
      "acceptanceCriteria": [
        "At least 3 fractions lessons are added to the backend initialization",
        "Each lesson includes brainrot-themed content with clear explanations",
        "Lessons cover key fractions concepts appropriate for grades 6-8",
        "Each lesson includes pro tips sections"
      ]
    },
    {
      "id": "REQ-64",
      "text": "Expand the backend lesson initialization to include at least 3 comprehensive lessons for the 'Decimals' topic, covering place value, decimal operations (addition, subtraction, multiplication, division), and converting between fractions and decimals. Each lesson must include brainrot-themed explanations, examples, and pro tips suitable for middle school (grades 6-8).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-final"
        ],
        "quotes": [
          "Add lessons to all topics"
        ]
      },
      "acceptanceCriteria": [
        "At least 3 decimals lessons are added to the backend initialization",
        "Each lesson includes brainrot-themed content with clear explanations",
        "Lessons cover key decimals concepts appropriate for grades 6-8",
        "Each lesson includes pro tips sections"
      ]
    },
    {
      "id": "REQ-65",
      "text": "Expand the backend lesson initialization to include at least 3 comprehensive lessons for the 'Percentages' topic, covering percent basics, calculating percentages, percent increase/decrease, and real-world percentage applications (discounts, tips, sales tax). Each lesson must include brainrot-themed explanations, examples, and pro tips suitable for middle school (grades 6-8).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-final"
        ],
        "quotes": [
          "Add lessons to all topics"
        ]
      },
      "acceptanceCriteria": [
        "At least 3 percentages lessons are added to the backend initialization",
        "Each lesson includes brainrot-themed content with clear explanations",
        "Lessons cover key percentage concepts appropriate for grades 6-8",
        "Each lesson includes pro tips sections"
      ]
    },
    {
      "id": "REQ-66",
      "text": "Expand the backend lesson initialization to include at least 3 comprehensive lessons for the 'Algebra' topic, covering algebraic expressions, solving one-step and two-step equations, combining like terms, and the distributive property. Each lesson must include brainrot-themed explanations, examples, and pro tips suitable for middle school (grades 6-8).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-final"
        ],
        "quotes": [
          "Add lessons to all topics"
        ]
      },
      "acceptanceCriteria": [
        "At least 3 algebra lessons are added to the backend initialization",
        "Each lesson includes brainrot-themed content with clear explanations",
        "Lessons cover foundational algebra concepts appropriate for grades 6-8",
        "Each lesson includes pro tips sections"
      ]
    },
    {
      "id": "REQ-67",
      "text": "Expand the backend lesson initialization to include at least 3 comprehensive lessons for the 'Geometry' topic, covering area and perimeter of 2D shapes (rectangles, triangles, circles), volume of 3D shapes (rectangular prisms, cylinders), and angle relationships (complementary, supplementary). Each lesson must include brainrot-themed explanations, examples, and pro tips suitable for middle school (grades 6-8).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-final"
        ],
        "quotes": [
          "Add lessons to all topics"
        ]
      },
      "acceptanceCriteria": [
        "At least 3 geometry lessons are added to the backend initialization",
        "Each lesson includes brainrot-themed content with clear explanations",
        "Lessons cover key geometry concepts appropriate for grades 6-8",
        "Each lesson includes pro tips sections"
      ]
    },
    {
      "id": "REQ-68",
      "text": "Expand the backend lesson initialization to include at least 3 comprehensive lessons for the 'Ratios' topic, covering ratio basics and simplification, equivalent ratios, solving proportions, and real-world ratio applications (recipes, scale models). Each lesson must include brainrot-themed explanations, examples, and pro tips suitable for middle school (grades 6-8).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-final"
        ],
        "quotes": [
          "Add lessons to all topics"
        ]
      },
      "acceptanceCriteria": [
        "At least 3 ratios lessons are added to the backend initialization",
        "Each lesson includes brainrot-themed content with clear explanations",
        "Lessons cover key ratio and proportion concepts appropriate for grades 6-8",
        "Each lesson includes pro tips sections"
      ]
    },
    {
      "id": "REQ-69",
      "text": "Expand the backend lesson initialization to include at least 3 comprehensive lessons for the 'Multiplication' topic, covering multiplication facts and strategies, multi-digit multiplication, properties of multiplication (commutative, associative, distributive), and word problems. Each lesson must include brainrot-themed explanations, examples, and pro tips suitable for middle school (grades 6-8).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-final"
        ],
        "quotes": [
          "Add lessons to all topics"
        ]
      },
      "acceptanceCriteria": [
        "At least 3 multiplication lessons are added to the backend initialization",
        "Each lesson includes brainrot-themed content with clear explanations",
        "Lessons cover multiplication concepts appropriate for grades 6-8",
        "Each lesson includes pro tips sections"
      ]
    },
    {
      "id": "REQ-70",
      "text": "Expand the backend lesson initialization to include at least 3 comprehensive lessons for the 'Division' topic, covering division facts and strategies, long division, division with remainders, divisibility rules, and word problems. Each lesson must include brainrot-themed explanations, examples, and pro tips suitable for middle school (grades 6-8).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-final"
        ],
        "quotes": [
          "Add lessons to all topics"
        ]
      },
      "acceptanceCriteria": [
        "At least 3 division lessons are added to the backend initialization",
        "Each lesson includes brainrot-themed content with clear explanations",
        "Lessons cover division concepts appropriate for grades 6-8",
        "Each lesson includes pro tips sections"
      ]
    },
    {
      "id": "REQ-71",
      "text": "Verify that the lesson browser page correctly displays all newly added lessons organized by topic in the grid layout with proper loading states and error handling.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-final"
        ],
        "quotes": [
          "Add lessons to all topics"
        ]
      },
      "acceptanceCriteria": [
        "All newly added lessons for all 8 topics appear in the lesson browser",
        "Lessons are properly organized and filterable by topic",
        "Loading states display correctly while fetching lessons",
        "Error handling with retry functionality works if lesson fetch fails"
      ]
    },
    {
      "id": "REQ-72",
      "text": "Verify that lesson detail pages render the full content of all newly added lessons including formatted text, pro tips sections, and completion functionality for all 8 topics.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-final"
        ],
        "quotes": [
          "Add lessons to all topics"
        ]
      },
      "acceptanceCriteria": [
        "Lesson detail pages display complete content for all new lessons",
        "Markdown-style formatting (headings, bold text, lists) renders correctly",
        "Pro tips sections are extracted and displayed prominently",
        "Mark as complete button functions correctly for all lessons"
      ]
    }
  ],
  "constraints": [
    "All lesson content must maintain brainrot-themed humor and references consistent with existing content",
    "Lesson difficulty and content must be appropriate for middle school students (grades 6-8)",
    "Each topic must have at least 3 lessons to provide comprehensive coverage",
    "All lessons must follow the existing Lesson type structure defined in backend/main.mo"
  ],
  "nonGoals": [
    "Creating new practice problems (focus is on lessons only)",
    "Modifying the lesson browser UI layout or design",
    "Adding new topics beyond the existing 8 topics",
    "Implementing lesson prerequisites or sequencing logic"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}