{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add comprehensive lessons for all practice mode topics - Frontend verification",
  "requirements": [
    {
      "id": "REQ-71",
      "summary": "Verify that the lesson browser page correctly displays all newly added lessons organized by topic in the grid layout with proper loading states and error handling.",
      "acceptanceCriteria": [
        "All newly added lessons for all 8 topics appear in the lesson browser",
        "Lessons are properly organized and filterable by topic",
        "Loading states display correctly while fetching lessons",
        "Error handling with retry functionality works if lesson fetch fails"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LessonBrowser.tsx",
          "operation": "modify",
          "description": "Review and verify that the existing lesson browser correctly displays all lessons fetched via useLessons hook, including the newly added backend lessons for all 8 topics (Fractions, Decimals, Percentages, Algebra, Geometry, Ratios, Multiplication, Division). Ensure the grid layout, loading states, error handling with retry, and topic organization work correctly for the expanded lesson set. Add topic filtering UI if not already present to allow users to filter lessons by topic."
        },
        {
          "path": "frontend/src/hooks/useLessons.ts",
          "operation": "modify",
          "description": "Verify that the useLessons hook correctly fetches all lessons from the backend actor's getLessons() method. Ensure proper error handling and React Query configuration to support the lesson browser's requirements for displaying the expanded lesson set."
        }
      ]
    },
    {
      "id": "REQ-72",
      "summary": "Verify that lesson detail pages render the full content of all newly added lessons including formatted text, pro tips sections, and completion functionality for all 8 topics.",
      "acceptanceCriteria": [
        "Lesson detail pages display complete content for all new lessons",
        "Markdown-style formatting (headings, bold text, lists) renders correctly",
        "Pro tips sections are extracted and displayed prominently",
        "Mark as complete button functions correctly for all lessons"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LessonDetail.tsx",
          "operation": "modify",
          "description": "Review and verify that the lesson detail page correctly renders all lesson content including the newly added comprehensive lessons for all 8 topics. Ensure markdown-style formatting (headings using ##, bold text using **, lists) renders correctly, pro tips sections are properly extracted and displayed prominently, and the mark as complete button works via useCompleteLesson hook for all lesson IDs."
        },
        {
          "path": "frontend/src/hooks/useCompleteLesson.ts",
          "operation": "modify",
          "description": "Verify that the useCompleteLesson mutation hook correctly calls the backend's completeLesson method and invalidates the progress query cache on success. Ensure it handles all lesson IDs from the expanded lesson set correctly."
        }
      ]
    }
  ]
}